app/views/talents/show.html.haml

%p
  - @talent.amoebas.each do |amoeba|
---
SELECT "amoebas".* FROM "amoebas" WHERE "amoebas"."talent_id" = 2