app/views/amoebas/index.html.haml

      %td= link_to "#{amoeba.name}", amoeba
      %td= link_to "#{Act.find(amoeba.act_id).name}", "acts/#{amoeba.act_id}"
      %td= link_to "#{Talent.find(amoeba.talent_id).name}", "talents/#{amoeba.talent_id}"
---
SELECT "acts".* FROM "acts" WHERE "acts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "talents".* FROM "talents" WHERE "talents"."id" = ? LIMIT 1  [["id", 2]]