app/views/amoebas/show.html.haml

SELECT "acts".* FROM "acts" WHERE "acts"."id" = ? LIMIT 1  [["id", 1]]
---
  %b Act:
  = link_to Act.find(@amoeba.act_id).name, "/acts/#{@amoeba.act_id}"

SELECT "talents".* FROM "talents" WHERE "talents"."id" = ? LIMIT 1  [["id", 1]]
---
  %b Talent:
  = link_to Talent.find(@amoeba.talent_id).name, "/talents/#{@amoeba.talent_id}"