app/views/amoebas/split.html.haml

SELECT "acts".* FROM "acts" WHERE "acts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "talents".* FROM "talents" WHERE "talents"."id" = ? LIMIT 1  [["id", 2]]
---
    %td= link_to baby.name, baby
    %td= link_to Act.find(baby.act_id).name, "/acts/#{baby.act_id}"
    %td= link_to Talent.find(baby.talent_id).name, "/talents/#{baby.talent_id}"