app/controllers/acts_controller.rb

  def index
    @acts = Act.all
---
SELECT "acts".* FROM "acts"

  def show
    @act = Act.find(params[:id])
---
SELECT "acts".* FROM "acts" WHERE "acts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @act = Act.new(params[:act])
    if @act.save
---
INSERT INTO "acts" ("created_at", "date_time", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 10 Jan 2014 17:38:39 UTC +00:00], ["date_time", nil], ["name", "floosiess"], ["updated_at", Fri, 10 Jan 2014 17:38:39 UTC +00:00]]