app/controllers/amoebas_controller.rb

  def index
    @amoebas = Amoeba.all
---
SELECT "amoebas".* FROM "amoebas"

  def show
    @amoeba = Amoeba.find(params[:id])
---
SELECT "amoebas".* FROM "amoebas" WHERE "amoebas"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @amoeba = Amoeba.new(params[:amoeba])

    if @amoeba.save
---
INSERT INTO "amoebas" ("act_id", "created_at", "gen_num", "name", "talent_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["act_id", 1], ["created_at", Fri, 10 Jan 2014 17:07:59 UTC +00:00], ["gen_num", 1], ["name", "oooooba"], ["talent_id", 2], ["updated_at", Fri, 10 Jan 2014 17:07:59 UTC +00:00]]

  def split
    @amoeba = Amoeba.find(params[:id])
---
SELECT "amoebas".* FROM "amoebas" WHERE "amoebas"."id" = ? LIMIT 1  [["id", "3"]]