app/controllers/talents_controller.rb

  def index
    @talents = Talent.all
---
SELECT "talents".* FROM "talents"

  def show
    @talent = Talent.find(params[:id])
---
SELECT "talents".* FROM "talents" WHERE "talents"."id" = ? LIMIT 1  [["id", "3"]]