app/views/acts/show.html.haml

SELECT "amoebas".* FROM "amoebas" WHERE "amoebas"."act_id" = 1
---
  %br
  - @act.amoebas.each do |amoeba|